
set -e

# https://en.wikipedia.org/wiki/ANSI_escape_code
lgreen='\033[1;32m'
yellow='\033[1;33m'
norm='\033[0m'
bold='\033[1m'

echo
echo "${lgreen}=============================================================="
echo " 一鍵部署 5 秒後開始運作 "
echo " ＊如要停止動作請按下 CRTL + C or Control + C"
echo "==============================================================${norm}"

sleep 5s

echo
echo "${yellow}=============================================================="
echo " 準備取得 Git 遠端 Url..."
echo "==============================================================${norm}"

sleep 1s
originUrl=$(git config --get remote.origin.url)

echo
echo "${lgreen}=============================================================="
echo " 目前遠端分支: ${originUrl} "
echo "==============================================================${norm}"

sleep 1s
split=${originUrl:0:5}
status='';
if [ $split = 'https' ]
then
  status='HTTPS'
else
  status='SSH'
fi

echo
echo "${lgreen}=============================================================="
echo " 傳輸方式將採用 $status "
echo " 目前遠端分支 URL：$originUrl "
echo "==============================================================${norm}"

sleep 5s

echo
echo "${yellow}=============================================================="
echo " 5 秒後開始編譯 Vue Cli "
echo " ＊如要停止動作請按下 CRTL + C or Control + C"
echo "==============================================================${norm}"

sleep 5s
npm run build

echo
echo "${lgreen}=============================================================="
echo " 編譯完成 "
echo "==============================================================${norm}"

echo
echo "${yellow}=============================================================="
echo " 移動到編譯完成的資料夾 "
echo "==============================================================${norm}"

cd dist

echo
echo "${yellow}=============================================================="
echo " 初始化 Git 與加入 Commit "
echo "==============================================================${norm}"

git init
git add .
git commit -m "update `date +'%Y-%m-%d %H:%M:%S'`";

echo
echo "${yellow}=============================================================="
echo " 5 秒後部署檔案到遠端分支 "
echo " ＊如要停止動作請按下 CRTL + C or Control + C"
echo "==============================================================${norm}"
sleep 5s
git push -f $originUrl master:gh-pages

echo
echo "${yellow}=============================================================="
echo " 部署完成 "
echo "==============================================================${norm}"

echo
echo "${lgreen}=============================================================="
echo " 一鍵部署指令結束 "
echo "==============================================================${norm}"
